spec/fixtures/express_checkout/payment/refund/failure.yml

--- 
http_interactions: 
- request: 
    method: post
    uri: https://api-3t.sandbox.paypal.com/nvp
    body: 
      encoding: US-ASCII
      string: USER=chardy_api1.gmail.com&PWD=8DTSWBZC7GDR3T4X&SIGNATURE=AG-8mOpuFhFyFOYHlaTUYn3Syf15AWJKRnfHMVsmCtC3DK51-ENEPqLS&VERSION=72.0&TRANSACTIONID=9H105857DB8084710&PROFILEREFERENCE=12345&PAYMENTREQUEST_0_CUSTOM=12345&PAYMENTREQUEST_0_INVNUM=12345&REFUNDTYPE=Full&PAYMENTREQUEST_0_AMT=9.00&AMT=9.00&PAYMENTREQUEST_0_CURRENCYCODE=USD&CURRENCYCODE=USD&METHOD=RefundTransaction
    headers: 
      User-Agent: 
      - PayPal::Payment/0.1
  response: 
    status: 
      code: 200
      message: OK
    headers: 
      Date: 
      - Wed, 27 Feb 2013 16:22:15 GMT
      Server: 
      - Apache
      Content-Length: 
      - "261"
      Connection: 
      - close
      Content-Type: 
      - text/plain; charset=utf-8
    body: 
      encoding: ASCII-8BIT
      string: TIMESTAMP=2013%2d02%2d27T16%3a22%3a16Z&CORRELATIONID=dd28f4c24b39&ACK=Failure&VERSION=72%2e0&BUILD=5331358&L_ERRORCODE0=10009&L_SHORTMESSAGE0=Transaction%20refused&L_LONGMESSAGE0=This%20transaction%20has%20already%20been%20fully%20refunded&L_SEVERITYCODE0=Error
    http_version: 
  recorded_at: Wed, 27 Feb 2013 16:22:16 GMT
recorded_with: VCR 2.3.0
